NRDaza/HC-SR04-PSOC5/PWM.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "PWM.h"
#include "Clock_1.h"
#include "Motor_aliases.h"
#include "Motor.h"
#include "InAumentar_aliases.h"
#include "InAumentar.h"
#include "InDisminuir_aliases.h"
#include "InDisminuir.h"
#include "Aumentar.h"
#include "Disminuir.h"
#include "ResetPin_aliases.h"
#include "ResetPin.h"
#include "ResetPWM_aliases.h"
#include "ResetPWM.h"
#include "LCD.h"
#include "Rs_aliases.h"
#include "Rs.h"
#include "E_aliases.h"
#include "E.h"
#include "D4_aliases.h"
#include "D4.h"
#include "D5_aliases.h"
#include "D5.h"
#include "D6_aliases.h"
#include "D6.h"
#include "D7_aliases.h"
#include "D7.h"
#include "Clock_2.h"
#include "LCD_Cntl_Port.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

